---
kind: type
id: T:Autodesk.Revit.DB.SweepProfile
source: html/1b77356c-e92b-e151-f8c9-727b3e2b8934.htm
---
# Autodesk.Revit.DB.SweepProfile

Represents a profile for sweep or swept blend elements.

## Syntax (C#)
```csharp
public class SweepProfile : APIObject
```